export const FAQ = [
  {
    Q: "Как да създам отбор за HackTUES 9?",
    A: "След като си си създал акаунт, натисни върху профилната си снимка в навигационното меню и кликни “Създай отбор”, ако все още не си в отбор.",
  },
  {
    Q: "Кога е крайният срок за регистрация по отборите?",
    A: "Крайният срок за регистрация на участниците и създаване на отбор е на <strong>18.02.2023г.</strong> включително.",
  },
  {
    Q: "Колко участници може да има в един отбор?",
    A: "Един отбор може да се състои от 3 до 5 участници.",
  },
  {
    Q: "Как се определя капитанът на отбора?",
    A: "Капитанът на отбора е създателят на съответния отбор. Но той винаги може да предаде ролята си на някой друг участник от отбора.",
  },
  {
    Q: "Как мога да се присъединя към отбор?",
    A: "Капитанът на дадения отбор трябва първо да те покани и чак тогава ще получиш нотификация на сайта, че имаш покана за отбор.",
  },
  {
    Q: "Какво да направя, ако искам да напусна отбор?",
    A: "В случай че участник иска да напусне отбора си, в сайта на събитието, на страницата на съответния отбор, има опция “напусни”. След нейното избиране участникът престава да бъде член на отбора.",
  },
  {
    Q: "Мога ли да изключа някой от отбора?",
    A: "Само капитанът може да изключи член на отбора.",
  },
  {
    Q: "Мога ли да изтрия отбора си?",
    A: "Само ако си капитан чрез “изтрий” бутона на страницата на отбора си.",
  },
  {
    Q: "Как ще протече самото събитие?",
    A: "Може да намериш информацията за програмата на HackTUES 9 на страницата <a href='/timetable'>Програма</a>.",
  },
  {
    Q: "Какво трябва да носим?",
    A: "Лаптопи, разклонители и добро настроение.",
  },
  {
    Q: "Ще има ли храна?",
    A: `Ще има обяд на 09, 10 и 11.03, както и Food Corner, където всеки може да си вземе каквото желае, както и чай, кафе и вода. Всеки е свободен да си донесе допълнително храна от вкъщи. 
        Ако някой има специфичен хранителен режим, е препоръчително да си носи храна, съответстваща на нуждите му.
        Молим участниците да си носят шишета за вода, тъй като ще има машини, от които могат да си сипват.
        `,
  },
  {
    Q: "Как ще общуваме с ментора?",
    A: "Всеки отбор избира своя ментор малко преди началото на хакатона. Запознанството между отбора и съответния му ментор се осъществява през общите канали за комуникация в Discord сървъра на събитието и със старта на хакатона на живо. Общуването ще се осъществява на живо или в Discord сървара в посочените удобни часове за менторите. Преди хакатона е подготвен уъркшоп за работа с ментор.",
  },
  {
    Q: "Какви са критериите за оценка?",
    A: "За повече информация за критериите за оценка може да видите регламента на HackTUES 9 на страницата <a href='/regulation'>Регламент</a>.",
  },
  {
    Q: "Ще бъда ли дисквалифициран, ако закъснея за работните дни и за полуфинала?",
    A: `Часовете за работа по проектите на територията на Форум Джон Атанасов в София Тех Парк са ориентировъчни - отборите ще могат да се явят на място най-рано в 09:00 и да напуснат територията на Джон Атанасов София Тех Парк най-късно в 21:00.
        Всеки отбор ще бъде информиран за часа на представянето на проекта си на полуфиналите, като трябва да бъде във Форум Джон Атанасов поне 20 минути по-рано.`,
  },
  {
    Q: "Как ще се провеждат полуфиналите?",
    A: "Полуфиналите ще се проведат сутринта на 11.03 - последният ден на хакатона.",
  },
  {
    Q: "Кога е финалът?",
    A: "Финалът ще се проведе следобед на 11.03 - последният ден на хакатона.",
  },
  {
    Q: "Какво ще стане, ако не попълня декларацията за информирано съгласие?",
    A: "Всеки участник трябва да попълни и изпрати декларацията за информирано съгласие, иначе няма да бъде допуснат до участие в хакатона.",
  },
  {
    Q: "Ще има ли награди?",
    A: "Естествено :D",
  },
];
