export const REGULATION = `Скъпи съученици, поздравяваме Ви за решението да се включите в предизвикателството, което предлага училищният хакатон. Тук ще намерите цялата информация, необходима за участие в хакатона и неговото провеждане. 

КАКВО Е Hack TUES?
Hack TUES е хакатон (състезание с компютърни проекти), в което отборите имат по-малко от 3 дни да направят авторски софтуерен/хардуерен проект по зададената от организаторите тема, използвайки всякакви технологии. Организира се ежегодно от ученици (най-често в 11 клас) от ТУЕС.

КАКВО ПРЕДСТОИ ПРЕДИ Hack TUES 9
Подготвили сме Ви за загрявка преди хакатона -  обучения на различни и интересни теми:
20.02 Теодор Панайотов - Как да генерираме и реализираме идея
23.02 Ивайло Каньов, Мартин Божилов - Python 
27.02 Росен Витанов -  Embedded 
1.03 Мартин Божилов, Калоян Дойчинов - Git, Github 
4.03 Калоян Дойчинов - Next.JS 13, WebDEV & TypeScript
(дата) Кики, Надя - Hack TUES 9 В какво се забърках
Ще се проведат в Zoom. Формулярите за регистрация ще бъдат пуснати скоро, така че следете социалните мрежи и електронните си пощи.
* - Цялата си работа от хакатона трябва да съхранявате в GitHub хранилище, което ще ви бъде предоставено от организаторите в началото на времето за работа

(да си напишем нашите лекции и кой ще ги води и да се реши кога ще са, ако може)

Как да участвате?
Първата стъпка е да се регистрирате:
Ако сте ученик от 8. до 12. клас в ТУЕС, можете да се регистрирате за участие на страницата за регистрация.
Регистрацията започва на 08.02 (понеделник) и свършва на 18.02 (четвъртък) 23:59:59. Лимитът на регистрираните отбори е 60, а ако се достигне преди крайния срок, регистрацията ще бъде затворена.
Когато се регистрирате, ще получите достъп до нова страница от сайта (Дискорд), на която ще получите инструкции за влизане и удостоверяване в Discord сървъра на събитието, което ще ви даде достъп до отборните ви канали. През Discord сървъра ще се осъществи цялата комуникация с организатори и ментори.

Втората стъпка е да съставите потвърден отбор:
Лимитът на регистрираните отбори е 60.
Учениците имат правото сами да съставят отборите си, като в един отбор могат да участват между 3 и 5 човека. Отборът Ви е потвърден, когато в него участват минимум 3-ма души.
Помислили сме и за хората, които нямат отбор. Ето защо създадохме канал в Discord, чрез който можете да се включите в отбор, търсещ си още съотборници.
(опишете си тиндъра, ако ще го има)

ВАЖНО: Ако до 18.02 включително не сте си намерили отбор, няма да можете да участвате на хакатона независимо дали сте се регистрирали като индивидуален участник.
Всеки индивидуален участник може да участва само в един отбор.


Третата стъпка е предаването на декларация за участие:
Всеки участник в хакатона трябва да предаде декларация за участие по образец най-късно до 04.03. В противен случай няма да бъде допуснат до участие в Hack TUES 9. Декларациите можете да изтеглите от профила си в сайта.



Декларация
За да участвате в Hack TUES Infinity, трябва да попълните декларация
Декларация за пълнолетни (линк)
Декларация за непълнолетни (линк)



Програма - - ЛОГИСТИКА



Тематични ментори?
Освен чрез специалната си лекция, професионалистите в сферата на темите ще подпомогнат участниците като дадат обратна връзка за идеята на всеки един отбор.
Консултацията с менторите ще става по график и започва в 9:00 на първия работен ден - 9.03 (четвъртък). Графикът ще бъде пуснат на участниците преди откриването.



Ментори
Всеки отбор разполага с един ментор, който е част от отбора.
В случай, че Вашият ментор не може да помогне с проблем, който имате, всеки друг може да се отзове на помощ, след като опишете проблема си, свързан с проекта. Комуникацията с менторите ще се осъществява чрез нашия Discord сървър.
Освен ИТ-специалисти сред менторите тази година ще има и тематични ментори. Те няма да Ви помагат с техническите проблеми, но ще бъдат на Ваше разположение, за да доразвиете идеята на проектите си спрямо темата и Вашите цели.
Ще Ви бъде предоставен график на менторите, за да добиете представа каква активност ще има от тяхна страна в различните времеви диапазони:
                           10:00 до 14:30
                           14:30 до 19:00
Целта на менторите е да Ви напътстват по време на работните дни.



ОЦЕНЯВАНЕ ОТ ЖУРИТО - СПОНСОРИ ИЛИ ЛОГИСТИКА


ОТГОВОРНОСТ  (логистика? За тех парка)
Участниците са длъжни да се съобразяват с програмата за провеждане на хакатона (откриване, време за работа, представяне пред журито и др.), да спазват всички инструкции на организаторите на събитието и доброволците, които помагат за организирането му.
Организаторите не носят отговорност за Вашата комуникация със съотборниците Ви по време на хакатона.


ДИСКВАЛИФИКАЦИЯ (доп. От спонсори)
Трябва да знаете, че ще се налага дисквалификация в следните случаи:
Ако даден проект не е авторски, съответният отбор може да бъде дисквалифициран.
Организаторите на събитието може да дисквалифицират участник, ако поведението на участника е непристойно или пречи на провеждането на хакатона.
Организаторите си запазват правото да дисквалифицират отбор, ако проектът им не е подходящ за събитието, има неморално съдържание или зловредна цел.
Отбор, който не изпълнява инструкциите на организаторите, може да бъде дисквалифициран.




ТОРМОЗ (допълване)
Не се толерира тормоз над екипа на Hack TUES 9, доброволците и участниците в събитието, под каквато и да е форма.
Ако сте подложен на тормоз, забележите, че някой друг е подложен на тормоз, или имате някакви други проблеми, моля свържете се с член от екипа на хакатона незабавно.



ПОЛИТИКА ЗА БИСКВИТКИ И ПОВЕРИТЕЛНОСТ - ИТ



Искрено се надяваме, че ще се забавлявате и че ще измислите уникални проекти и решения.






`;
