export const TIMES = [
  {
    day: "четвъртък",
    from: "09:00",
    to: "12:00",
  },
  {
    day: "четвъртък",
    from: "12:00",
    to: "15:00",
  },
  {
    day: "четвъртък",
    from: "15:00",
    to: "18:00",
  },
  {
    day: "четвъртък",
    from: "18:00",
    to: "21:00",
  },
  {
    day: "петък",
    from: "09:00",
    to: "12:00",
  },
  {
    day: "петък",
    from: "12:00",
    to: "15:00",
  },
  {
    day: "петък",
    from: "15:00",
    to: "18:00",
  },
  {
    day: "петък",
    from: "18:00",
    to: "21:00",
  },
];
